controllers/DataController.php

    public function actionCreate()
    {
        $request = Yii::$app->request;
        $model = new Data();

        if($request->isAjax){
            /*
            *   Process for ajax request
            */
            Yii::$app->response->format = Response::FORMAT_JSON;
            if($request->isGet){
                return [
                    'title'=> "Create new Data",
                    'content'=>$this->renderAjax('create', [
                        'model' => $model,
                    ]),
                    'footer'=> Html::button('Close',['class'=>'btn btn-default pull-left','data-dismiss'=>"modal"]).
                                Html::button('Save',['class'=>'btn btn-primary','type'=>"submit"])

                ];
            }else if($model->load($request->post()) && $model->save()){
---
INSERT INTO `data` (`card_number`, `date`, `volume`, `service`, `address_id`) VALUES ('257314971', '2021-02-25 04:23:19', -1000, 'Мойка', 10)

    protected function findModel($id)
    {
        if (($model = Data::findOne($id)) !== null) {
---
SELECT * FROM `data` WHERE `id`='4862'