views/data/index.php

SELECT COUNT(*) FROM `data` WHERE `date` >= '2015-04-01'
SELECT COUNT(*) FROM `data` WHERE (`date` >= '2015-04-01') AND (`date` <= '2015-05-01')
SELECT COUNT(*) FROM `data` WHERE (`date` >= '2015-05-01') AND (`date` <= '2015-06-01')
SELECT COUNT(*) FROM `data` WHERE (`date` >= '2015-06-01') AND (`date` <= '2015-07-01')
SELECT COUNT(*) FROM `data` WHERE (`date` >= '2015-07-01') AND (`date` <= '2015-08-01')
SELECT COUNT(*) FROM `data` WHERE (`date` >= '2015-08-01') AND (`date` <= '2015-09-01')
SELECT COUNT(*) FROM `data` WHERE (`date` >= '2015-09-01') AND (`date` <= '2015-10-01')
SELECT COUNT(*) FROM `data` WHERE (`date` >= '2015-10-01') AND (`date` <= '2015-11-01')
---

CrudAsset::register($this);

$year2015Count = \app\models\Data::find()->andFilterWhere(['>=','date', '2015-04-01'])->count();
$aprilCount =  \app\models\Data::find()->andFilterWhere(['>=',  'date','2015-04-01'])->andFilterWhere(['<=', 'date', '2015-05-01'])->count();
$mayCount =  \app\models\Data::find()->andFilterWhere(['>=',  'date','2015-05-01'])->andFilterWhere(['<=', 'date', '2015-06-01'])->count();
$juneCount =  \app\models\Data::find()->andFilterWhere(['>=',  'date','2015-06-01'])->andFilterWhere(['<=', 'date', '2015-07-01'])->count();
$julyCount =  \app\models\Data::find()->andFilterWhere(['>=',  'date','2015-07-01'])->andFilterWhere(['<=', 'date', '2015-08-01'])->count();
$augustCount =  \app\models\Data::find()->andFilterWhere(['>=',  'date','2015-08-01'])->andFilterWhere(['<=', 'date', '2015-09-01'])->count();
$septemberCount =  \app\models\Data::find()->andFilterWhere(['>=',  'date','2015-09-01'])->andFilterWhere(['<=', 'date', '2015-10-01'])->count();
$octoberCount =  \app\models\Data::find()->andFilterWhere(['>=',  'date','2015-10-01'])->andFilterWhere(['<=', 'date', '2015-11-01'])->count();