models/Data.php

    public function beforeSave($insert)
    {
        if($this->isNewRecord){
            if ($this->volume > 0){
                $lastInsert = Data::find()->where(['card_number' => $this->card_number])->andFilterWhere(['service' => $this->service])->orderBy(['id'=>SORT_DESC])->one();
                $newValue = $lastInsert->volume  + $this->volume;
                $this->volume = $newValue;
                $this->date  = date('Y-m-d H:i:s');
                $this->service = $lastInsert->service;
                $this->address_id = $lastInsert->address_id;
                $lastInsert->delete();
---
SELECT * FROM `data` WHERE (`card_number`='257314971') AND (`service`='Мойка') ORDER BY `id` DESC
DELETE FROM `data` WHERE `id`=4860